<template>
  <div class="list">
    <comment-view
      v-for="(comment, index) in comments"
      :key="index"
      :comment="comment"
    ></comment-view>
  </div>
</template>

<script lang="ts" setup>
import CommentView from './CommentView.vue'

const comments: Array<CommentData> = [
  {
    userId: '1',
    text: 'Берсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее анимеБерсеркер лучшее аниме',
  },
  {
    userId: '1',
    text: 'Берсеркер лучшее аниме',
  },
  {
    userId: '1',
    text: 'Берсеркер лучшее аниме',
  },
  {
    userId: '1',
    text: 'Берсеркер лучшее аниме',
  },
  {
    userId: '1',
    text: 'Берсеркер лучшее аниме',
  },
  {
    userId: '1',
    text: 'Берсеркер лучшее аниме',
  },
  {
    userId: '1',
    text: 'Берсеркер лучшее аниме',
  },
  {
    userId: '1',
    text: 'Берсеркер лучшее аниме',
  },
  {
    userId: '1',
    text: 'Берсеркер лучшее аниме',
  },
  {
    userId: '1',
    text: 'Берсеркер лучшее аниме',
  },
  {
    userId: '1',
    text: 'Берсеркер лучшее аниме',
  },
]
</script>

<style lang="scss" scoped></style>
